Tekla.Structures.AnalysisInternal.DotAnalysisModelConnectivityRule
The serialization structure for AnalysisModelConnectivityRule.

Tekla.Structures.AnalysisInternal.DotAnalysisModelConnectivityRule._AnalysisObject
The analysis object.

Tekla.Structures.AnalysisInternal.DotAnalysisModelConnectivityRule._Group1
The group name 1 of the connectivity rule.

Tekla.Structures.AnalysisInternal.DotAnalysisModelConnectivityRule._Group2
The group name 2 of the connectivity rule.

Tekla.Structures.AnalysisInternal.DotAnalysisModelConnectivityRule._Status
The status of the connectivity rule.

Tekla.Structures.AnalysisInternal.DotAnalysisModelConnectivityRule._MagneticDistance
The magnetic distance of the connectivity rule.

Tekla.Structures.AnalysisInternal.DotAnalysisModelConnectivityRule._Linkage1
The linkage 1 of the connectivity rule.

Tekla.Structures.AnalysisInternal.DotAnalysisModelConnectivityRule._Linkage2
The linkage 2 of the connectivity rule.

Tekla.Structures.AnalysisInternal.DotAnalysisModelConnectivityRule.ToStruct(Tekla.Structures.Analysis.AnalysisModelConnectivityRule)
DO NOT USE! For internal usage only!
P: P.

Tekla.Structures.AnalysisInternal.DotAnalysisModelConnectivityRule.FromStruct(Tekla.Structures.Analysis.AnalysisModelConnectivityRule)
DO NOT USE! For internal usage only!
P: P.